package common;

public class MobList {
	public static int[] boss_id = new int[] {
			1088/*搖滾蝗蟲*/,
			1089/*蛙王*/,
			1090/*波利之王*/,
			1091/*龍蠅*/,
			1092/*流浪之狼*/,
			1093/*藍瘋兔*/,
			1096/*天使波利*/,
			1120/*幽靈波利*/,
			1259/*獅鷲獸*/,
			1268/*血腥騎士*/,
			1289/*狂暴蟻后*/,
			1582/*惡魔波利*/,
			1618/*溫古力安特*/,
			1765/*巴基力 蘭特克力斯*/,
			1795/*血腥騎士*/
	};
	
	public static int[] mvp_id = new int[] {
			1038/*俄塞里斯*/,
			1039/*巴風特*/,
			1046/*死靈*/,
			1059/*蜂后*/,
			1086/*黃金蟲*/,
			1087/*獸人英雄*/,
			1112/*海盜之王*/,
			1115/*虎王*/,
			1147/*蟻后*/,
			1150/*月夜貓*/,
			1157/*法老王*/,
			1159/*皮里恩*/,
			1190/*獸人酋長*/,
			1251/*冰暴騎士*/,
			1272/*黑暗之王*/,
			1312/*烏龜將軍*/,
			1373/*死靈騎士*/,
			1389/*德古拉伯爵*/,
			1418/*墨蛇君*/,
			1492/*元靈武士*/,
			1511/*古埃及王*/,
			1518/*白素貞*/,
			1583/*塔奧群卡*/,
			1623/*RSX-0806*/,
			1630/*白素貞*/,
			1685/*貝思波*/,
			1688/*嗒尼小姐*/,
			1708/*魔劍士 達納托斯的記憶*/,
			1719/*迪塔勒泰晤勒斯*/,
			1734/*齊爾-D-01*/,
			1751/*蘭特克力斯*/,
			1768/*幽暗夢魘*/,
			1779/*水晶龍*/,
			1785/*阿特羅斯*/,
			1832/*伊夫利特*/,
			1871/*墮落大神官 悉潘*/,
			1873/*詛咒蠅*/,
			1874/*詛咒蠅王*/,
			1885/*青冠龍*/,
			1916/*魔王夢羅克*/,
			1917/*負傷夢羅克*/,
			1990/*硬石猛瑪*/,
			2068/*波伊塔塔*/
	};
	
	public static boolean isBoss(int class_) {
		int i;
		for(i = 0; i < boss_id.length && class_ > boss_id[i]; i++);
		if (i < boss_id.length && class_ == boss_id[i])
			return true;
		return false;
	}
	
	public static boolean isMvp(int class_) {
		int i;
		for(i = 0; i < mvp_id.length && class_ > mvp_id[i]; i++);
		if (i < mvp_id.length && class_ == mvp_id[i])
			return true;
		return false;
	}
}
